Tekla Open API Reference for Tekla Structures 2025
StructuresDialogArrayAttribute Methods
The StructuresDialogArrayAttribute type exposes the following members.
Methods
Name | Description
ToString
 Returns a string that represents the current StructuresDialogArrayAttribute object.
 (Overrides Object.ToString().)
Top
See Also
Reference
StructuresDialogArrayAttribute Class
Tekla.Structures.Dialog Namespace